Project/Toir.Adaptation/src/InformationRegisters/торо_ДанныеАСУТП/торо_ДанныеАСУТП.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="d0f45d1e-82ba-484a-bdb0-122d9d61b397">
  <name>торо_ДанныеАСУТП</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources extendedConfigurationObject="8151974e-088b-4b13-91e7-9c07591ae504">
    <name>Ошибка</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="d4e19327-e374-4674-961c-1fe227487121">
    <name>Обработан</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions extendedConfigurationObject="39f215a5-ba6e-4b15-9199-8fb11a1d932f">
    <name>Подключение</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="6cebbf42-71c2-4053-ab55-4e594703b8ff">
    <name>ИДСеанса</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir.Adaptation/src/InformationRegisters/торо_СоответствияТеговАСУТПОбъектамТОИР/торо_СоответствияТеговАСУТПОбъектамТОИР.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>торо_СоответствияТеговАСУТПОбъектамТОИР</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources>
    <name>Отключить</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources>
    <name>ОбъектРемонта</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources>
    <name>ТипСигнала</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources>
    <name>Ответственный</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources>
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources>
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources>
    <name>Состояние</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources>
    <name>Показатель</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources>
    <name>ПричинаПростоя</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources>
    <name>ВидДефекта</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources>
    <name>ПараметрНаработки</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources>
    <name>ПоказательKPI</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions>
    <name>Подключение</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>НаименованиеОР</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </dimensions>
  <dimensions>
    <name>Тег</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir.Adaptation/src/InformationRegisters/торо_ОчередьУведомлений/торо_ОчередьУведомлений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="05bc7005-d271-4d0f-b978-6222cabdae7e">
  <name>торо_ОчередьУведомлений</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources extendedConfigurationObject="c3b14dd5-d2d8-44f5-9a6a-fb1a98b70549">
    <name>ТемаПисьма</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="e3558519-e6a8-4b99-8f7c-9ccdc68cc619">
    <name>ТелоПисьма</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <attributes extendedConfigurationObject="f406dd60-181a-49b4-b5f3-066d4214c6ed">
    <name>ОписаниеОшибки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <dimensions extendedConfigurationObject="a2afda4c-62a0-4acd-b681-a3d6cfd51238">
    <name>Пользователь</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="cfca17f5-e0b8-4af8-9a61-550dda4d9180">
    <name>ID_уведомления</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </dimensions>
  <dimensions extendedConfigurationObject="6df3c419-054f-4c0b-97fb-0e373cda0788">
    <name>СпособУведомления</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="33d9092d-8133-4d9d-906c-992514b33041">
    <name>Источник</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir.Adaptation/src/InformationRegisters/торо_ТекущееСостояниеОР/торо_ТекущееСостояниеОР.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>торо_ТекущееСостояниеОР</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ВидЭксплуатации</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions>
    <name>ОбъектРемонта</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir.Adaptation/src/Documents/торо_УчетКонтролируемыхПоказателей/торо_УчетКонтролируемыхПоказателей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>торо_УчетКонтролируемыхПоказателей</name>
  <objectBelonging>Adopted</objectBelonging>
  <registerRecords>InformationRegister.торо_ЗначенияКонтролируемыхПоказателей</registerRecords>
  <attributes>
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="17acea66-f6c9-487b-a647-e9cc33ee27ab">
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="d76ccf21-2b19-452e-9028-4edb77481e00">
    <name>Показатели</name>
    <objectBelonging>Adopted</objectBelonging>
  </tabularSections>
</mdclass:Document>

Project/Toir.Adaptation/src/Documents/торо_ВыявленныеДефекты/торо_ВыявленныеДефекты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>торо_ВыявленныеДефекты</name>
  <objectBelonging>Adopted</objectBelonging>
  <registerRecords>InformationRegister.торо_ВыявленныеДефекты</registerRecords>
  <attributes>
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Инициатор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>КонтактноеЛицоИнициатора</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДатаОбнаружения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СпособСогласования</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДефектВыявленВПроцессе</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ОбъектРемонта</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ПодразделениеИсполнитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Комиссия</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ИзМобильного</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="79fbf4a8-8f51-4cef-917b-3e00059df530">
    <name>гкс_Влияние</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="e4aede75-6f77-4f7d-9149-2cd4d20b2f34">
    <name>гкс_ДефектОформленПоТАГ</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="7c71a5eb-8ff5-48ba-99f5-fb9859401460">
    <name>гкс_НомерТАГ</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="2fadb04b-3aaa-4dd8-b305-d053aced95ae">
    <name>гкс_СрочностьВоздействия</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="e5d0d56b-7671-492d-a748-7b755db0a10d">
    <name>гкс_КачественнаяОценка</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections>
    <name>СписокДефектов</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>ДефектВыявленВПроцессе</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ДатаНачалаРемонта</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>КрайняяДопустимаяДатаЗавершенияРемонта</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ДефектПричина</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ВидРемонтов</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ОбъектРемонта</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ДатаОкончанияРемонта</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ОтказавшийЭлемент</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ТиповойДефект</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ВидДефекта</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>КритичностьДефекта</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ДефектОписание</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>300</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>ПоследствияДефекта</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>150</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>НаправлениеНаУстранение</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>300</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>ПодразделениеИсполнитель</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ГарантийныйРемонт</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ID</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>36</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДокументыОснования</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>ДокументОснование</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РезультатыПодбораИзМатрицыОценкиРисков</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>ID_Ремонта</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>36</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>РезультатВыбора</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="0e256218-3632-4e2f-81f1-fbae93c7e394">
    <name>гкс_ФайлыФиксации</name>
    <objectBelonging>Adopted</objectBelonging>
  </tabularSections>
</mdclass:Document>

Project/Toir.Adaptation/src/CommonModules/торо_ОбработкаДанныхАСУТП/Module.bsl
#Область СлужебныеПроцедурыИФункции

// гкс+ [Интеграция] Куст 26.03.2020
Функция ПолучитьНовыйТекстЗапроса()
	Возврат "ВЫБРАТЬ
       |	торо_ДанныеАСУТП.Тег КАК Тег,
       |	торо_ДанныеАСУТП.НаименованиеОР КАК НаименованиеОР,
       |	торо_ДанныеАСУТП.Дата КАК Дата,
       |	торо_ДанныеАСУТП.МеткаВремени КАК МеткаВремени,
       |	торо_ДанныеАСУТП.Значение КАК Значение,
       |	торо_ДанныеАСУТП.ИДСеанса КАК ИДСеанса,
       |	торо_ДанныеАСУТП.ИДЗаписи КАК ИДЗаписи,
       |	торо_ДанныеАСУТП.Подключение КАК Подключение
       |ПОМЕСТИТЬ табАСУТП
       |ИЗ
       |	РегистрСведений.торо_ДанныеАСУТП КАК торо_ДанныеАСУТП
       |ГДЕ
       |	торо_ДанныеАСУТП.ИДСеанса В(&ИДСеанса)
       |	И торо_ДанныеАСУТП.Ошибка = ЛОЖЬ
       |	И торо_ДанныеАСУТП.Обработан = ЛОЖЬ
       |;
       |
       |////////////////////////////////////////////////////////////////////////////////
       |ВЫБРАТЬ
       |	торо_ДанныеАСУТП.Тег КАК Тег,
       |	торо_ДанныеАСУТП.НаименованиеОР КАК НаименованиеОР,
       |	торо_ДанныеАСУТП.Дата КАК Дата,
       |	торо_ДанныеАСУТП.МеткаВремени КАК МеткаВремени,
       |	торо_ДанныеАСУТП.Значение КАК Значение,
       |	торо_ДанныеАСУТП.ИДСеанса КАК ИДСеанса,
       |	торо_ДанныеАСУТП.ИДЗаписи КАК ИДЗаписи,
       |	торо_ДанныеАСУТП.Подключение КАК Подключение,
       |	торо_СоответствияТеговАСУТПОбъектамТОИР.ОбъектРемонта КАК ОР,
       |	торо_СоответствияТеговАСУТПОбъектамТОИР.ТипСигнала КАК ТипСигнала,
       |	торо_СоответствияТеговАСУТПОбъектамТОИР.Показатель КАК Показатель,
       |	торо_СоответствияТеговАСУТПОбъектамТОИР.ПараметрНаработки КАК ПараметрНаработки,
       |	ЕСТЬNULL(гкс_СоответствиеЗначенийСостояниям.Состояние, торо_СоответствияТеговАСУТПОбъектамТОИР.Состояние) КАК Состояние,
       |	торо_СоответствияТеговАСУТПОбъектамТОИР.Ответственный КАК Ответственный,
       |	торо_СоответствияТеговАСУТПОбъектамТОИР.Подразделение КАК Подразделение,
       |	торо_СоответствияТеговАСУТПОбъектамТОИР.Организация КАК Организация,
       |	торо_СоответствияТеговАСУТПОбъектамТОИР.ВидДефекта КАК ТиповойДефект,
       |	ЕСТЬNULL(гкс_СоответствиеЗначенийСостояниям.ПричинаПростоя,
	   |		торо_СоответствияТеговАСУТПОбъектамТОИР.ПричинаПростоя) КАК ПричинаПростоя,
       |	торо_СоответствияТеговАСУТПОбъектамТОИР.ПоказательKPI КАК ПоказательКПИ
       |ПОМЕСТИТЬ ИсхДанные
       |ИЗ
       |	табАСУТП КАК торо_ДанныеАСУТП
       |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_СоответствияТеговАСУТПОбъектамТОИР КАК торо_СоответствияТеговАСУТПОбъектамТОИР
       |		ПО торо_ДанныеАСУТП.Подключение = торо_СоответствияТеговАСУТПОбъектамТОИР.Подключение
       |			И торо_ДанныеАСУТП.Тег = торо_СоответствияТеговАСУТПОбъектамТОИР.Тег
       |			И торо_ДанныеАСУТП.НаименованиеОР = торо_СоответствияТеговАСУТПОбъектамТОИР.НаименованиеОР
       |			И (торо_СоответствияТеговАСУТПОбъектамТОИР.Отключить = ЛОЖЬ)
       |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.гкс_СоответствиеЗначенийСостояниям КАК гкс_СоответствиеЗначенийСостояниям
       |		ПО торо_ДанныеАСУТП.Подключение = гкс_СоответствиеЗначенийСостояниям.Подключение
       |			И торо_ДанныеАСУТП.Тег = гкс_СоответствиеЗначенийСостояниям.Тег
       |			И торо_ДанныеАСУТП.Значение = гкс_СоответствиеЗначенийСостояниям.Значение
       |ГДЕ
       |	торо_ДанныеАСУТП.Подключение.гкс_СписокТегов = 0
	   |И ( торо_СоответствияТеговАСУТПОбъектамТОИР.ОбъектРемонта есть NULL
	   | ИЛИ Не торо_СоответствияТеговАСУТПОбъектамТОИР.ОбъектРемонта = Значение(Справочник.торо_ОбъектыРемонта.ПустаяСсылка))
       |
       |ОБЪЕДИНИТЬ ВСЕ
       |
       |ВЫБРАТЬ
       |	торо_ДанныеАСУТП.Тег,
       |	торо_ДанныеАСУТП.НаименованиеОР,
       |	торо_ДанныеАСУТП.Дата,
       |	торо_ДанныеАСУТП.МеткаВремени,
       |	торо_ДанныеАСУТП.Значение,
       |	торо_ДанныеАСУТП.ИДСеанса,
       |	торо_ДанныеАСУТП.ИДЗаписи,
       |	торо_ДанныеАСУТП.Подключение,
       |	гкс_ТегиНаработки.ОР,
       |	ЗНАЧЕНИЕ(Перечисление.торо_ТипыСигналовАСУТП.Наработка),
       |	NULL,
       |	гкс_ТегиНаработки.ПараметрНаработки,
       |	NULL,
       |	торо_ДанныеАСУТП.Подключение.гкс_Ответственный,
       |	торо_ДанныеАСУТП.Подключение.гкс_Подразделение,
       |	торо_ДанныеАСУТП.Подключение.гкс_Организация,
       |	торо_ДанныеАСУТП.Подключение.гкс_ВидДефекта,
       |	NULL,
       |	NULL
       |ИЗ
       |	табАСУТП КАК торо_ДанныеАСУТП
       |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.гкс_ТегиНаработки КАК гкс_ТегиНаработки
       |		ПО торо_ДанныеАСУТП.Тег = гкс_ТегиНаработки.Тег 
	   | И Не гкс_ТегиНаработки.ОР = Значение(Справочник.торо_ОбъектыРемонта.ПустаяСсылка)
       |ГДЕ
       |	торо_ДанныеАСУТП.Подключение.гкс_СписокТегов = 1
       |
       |ОБЪЕДИНИТЬ ВСЕ
       |
       |ВЫБРАТЬ
       |	торо_ДанныеАСУТП.Тег,
       |	торо_ДанныеАСУТП.НаименованиеОР,
       |	торо_ДанныеАСУТП.Дата,
       |	торо_ДанныеАСУТП.МеткаВремени,
       |	торо_ДанныеАСУТП.Значение,
       |	торо_ДанныеАСУТП.ИДСеанса,
       |	торо_ДанныеАСУТП.ИДЗаписи,
       |	торо_ДанныеАСУТП.Подключение,
       |	гкс_ТегиПоказателей.ОР,
       |	ЗНАЧЕНИЕ(Перечисление.торо_ТипыСигналовАСУТП.Показатель),
       |	гкс_ТегиПоказателей.Показатель,
       |	NULL,
       |	NULL,
       |	торо_ДанныеАСУТП.Подключение.гкс_Ответственный,
       |	торо_ДанныеАСУТП.Подключение.гкс_Подразделение,
       |	торо_ДанныеАСУТП.Подключение.гкс_Организация,
       |	торо_ДанныеАСУТП.Подключение.гкс_ВидДефекта,
       |	NULL,
       |	NULL
       |ИЗ
       |	табАСУТП КАК торо_ДанныеАСУТП
       |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.гкс_ТегиПоказателей КАК гкс_ТегиПоказателей
       |		ПО торо_ДанныеАСУТП.Тег = гкс_ТегиПоказателей.Тег 
	   | И Не гкс_ТегиПоказателей.ОР = Значение(Справочник.торо_ОбъектыРемонта.ПустаяСсылка)
       |ГДЕ
       |	торо_ДанныеАСУТП.Подключение.гкс_СписокТегов = 2
       |;
       |
       |////////////////////////////////////////////////////////////////////////////////
       |ВЫБРАТЬ
       |	ИсхДанные.Тег КАК Тег,
       |	ИсхДанные.НаименованиеОР КАК НаименованиеОР,
       |	ИсхДанные.Дата КАК Дата,
       |	ИсхДанные.МеткаВремени КАК МеткаВремени,
       |	ИсхДанные.Значение КАК Значение,
       |	ИсхДанные.ОР КАК ОР,
       |	ИсхДанные.ТипСигнала КАК ТипСигнала,
       |	ИсхДанные.Показатель КАК Показатель,
       |	ИсхДанные.ПараметрНаработки КАК ПараметрНаработки,
       |	ИсхДанные.Состояние КАК Состояние,
       |	ИсхДанные.Ответственный КАК Ответственный,
       |	ИсхДанные.Подразделение КАК Подразделение,
       |	ИсхДанные.Организация КАК Организация,
       |	ИсхДанные.ПричинаПростоя КАК ПричинаПростоя,
       |	ИсхДанные.ПоказательКПИ КАК ПоказательКПИ,
       |	ИсхДанные.ИДСеанса КАК ИДСеанса,
       |	ИсхДанные.ИДЗаписи КАК ИДЗаписи,
       |	ИсхДанные.Подключение КАК Подключение,
       |	ВЫБОР
       |		КОГДА ИсхДанные.ОР ЕСТЬ NULL
       |			ТОГДА ИСТИНА
       |		ИНАЧЕ ЛОЖЬ
       |	КОНЕЦ КАК Ошибка,
       |	ИСТИНА КАК Обработан,
       |	ИсхДанные.ТиповойДефект КАК ТиповойДефект,
       |	торо_ТиповыеДефектыОборудования.ВидДефекта КАК ВидДефекта,
       |	торо_ТиповыеДефектыОборудования.КритичностьДефекта КАК КритичностьДефекта,
       |	торо_ТиповыеДефектыОборудования.ОписаниеДефекта КАК ДефектОписание,
       |	торо_ТиповыеДефектыОборудования.ПоследствиеДефекта КАК ПоследствияДефекта,
       |	торо_ТиповыеДефектыОборудования.НаправлениеНаУстранение КАК НаправлениеНаУстранение,
       |	торо_ТиповыеДефектыОборудования.ПричиныВозникновенияДефекта.(
       |		НомерСтроки КАК НомерСтроки,
       |		Причина КАК Причина
       |	) КАК ПричиныВозникновенияДефекта
       |ИЗ
       |	ИсхДанные КАК ИсхДанные
       |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.торо_ТиповыеДефектыОборудования КАК торо_ТиповыеДефектыОборудования
       |		ПО ИсхДанные.ТиповойДефект = торо_ТиповыеДефектыОборудования.Ссылка
       |
       |УПОРЯДОЧИТЬ ПО
       |	Подключение,
       |	Тег,
       |	НаименованиеОР,
       |	Дата
       |;
       |
       |////////////////////////////////////////////////////////////////////////////////
       |ВЫБРАТЬ
       |	торо_ДанныеАСУТП.Тег КАК Тег,
       |	торо_ДанныеАСУТП.НаименованиеОР КАК НаименованиеОР,
       |	торо_ДанныеАСУТП.Дата КАК Дата,
       |	торо_ДанныеАСУТП.МеткаВремени КАК МеткаВремени,
       |	торо_ДанныеАСУТП.Значение КАК Значение,
       |	торо_ДанныеАСУТП.ИДСеанса КАК ИДСеанса,
       |	торо_ДанныеАСУТП.ИДЗаписи КАК ИДЗаписи,
       |	торо_ДанныеАСУТП.Подключение КАК Подключение
       |ИЗ
       |	РегистрСведений.торо_ДанныеАСУТП КАК торо_ДанныеАСУТП
       |ГДЕ
       |	торо_ДанныеАСУТП.ИДСеанса В(&ИДСеанса)
       |	И торо_ДанныеАСУТП.Ошибка = ИСТИНА";
КонецФункции
// гкс- [Интеграция] Куст 26.03.2020

// гкс+ [Интеграция] Куст 17.03.2020
Процедура ОбработатьСигналНаработкаОбщий(Выборка, ОсновнаяИерархия, ДокументОбъект)
	Если ДокументОбъект = Неопределено Тогда 
		ДокументОбъект = Документы.торо_УчетНаработкиОборудования.СоздатьДокумент();
		ЗаполнитьЗначенияСвойств(ДокументОбъект, Выборка);
		ДокументОбъект.Дата = ТекущаяДата();
		ДокументОбъект.Комментарий = НСтр("es='El documento es formado automáticamente a la carga de los SISTEMAS"
			+ " informatizados de gestión ТП dados.';ru='Документ сформирован автоматически при загрузке данных АСУ"
			+ " ТП.';en='The document is generated automatically when loading the data from the automatic"
			+ " process control system.'");
	КонецЕсли;
	
	НоваяСтрока = ДокументОбъект.НаработкаОбъектов.Добавить();
	НоваяСтрока.Объект = выборка.ОР;
	НоваяСтрока.Показатель = Выборка.ПараметрНаработки;
	НоваяСтрока.Наработка = Выборка.Значение;
	НоваяСтрока.ДатаРаботыПо = Выборка.Дата;
	
	ЗначениеНаработки = торо_РаботаСНаработкой.ПолучитьТекущееЗначениеНаработки(НоваяСтрока.Объект, 
		НоваяСтрока.Показатель, Неопределено);
	Если ЗначениеЗаполнено(ЗначениеНаработки) Тогда
		НоваяСтрока.ДатаРаботыС = ЗначениеНаработки.НаработаноДата;
		НоваяСтрока.СтароеЗначение = ЗначениеНаработки.НаработаноЗначение;
	КонецЕсли;
	НоваяСтрока.НовоеЗначение = НоваяСтрока.СтароеЗначение + НоваяСтрока.Наработка;
	НоваяСтрока.Иерархия = ОсновнаяИерархия;
	
КонецПроцедуры

Процедура ОбработатьСигналПоказательОбщий(Выборка, СоздаватьДефекты, ДокументОбъект, ВыборкаКСозданиюДефектов)
	Если ДокументОбъект = Неопределено Тогда 
		ДокументОбъект = Документы.торо_УчетКонтролируемыхПоказателей.СоздатьДокумент();
		ЗаполнитьЗначенияСвойств(ДокументОбъект, Выборка);
		ДокументОбъект.Дата = Выборка.МеткаВремени;
		ДокументОбъект.Комментарий = НСтр("es='El documento es formado automáticamente a la carga de los SISTEMAS"
		+ " informatizados de gestión ТП dados.';ru='Документ сформирован автоматически при загрузке данных АСУ"
		+ " ТП.';en='The document is generated automatically when loading the data from the automatic"
		+ " process control system.'");
	КонецЕсли;
	
	НоваяСтрока = ДокументОбъект.Показатели.Добавить();
	ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
	НоваяСтрока.ОбъектРемонта = Выборка.ОР;
	НоваяСтрока.ДатаКонтроля = Выборка.Дата;
	
	Если СоздаватьДефекты Тогда
		ВыборкаКСозданиюДефектов.Добавить(Выборка);
	КонецЕсли;
КонецПроцедуры
// гкс- [Интеграция] Куст 17.03.2020

&ИзменениеИКонтроль("ОбработатьДанные")
Процедура Расш_гкс_ОбработатьДанные()
	#Удаление
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	торо_ДанныеАСУТП.МеткаВремени КАК МеткаВремени,
	               |	торо_ДанныеАСУТП.ИДСеанса КАК ИДСеанса
	               |ИЗ
	               |	РегистрСведений.торо_ДанныеАСУТП КАК торо_ДанныеАСУТП
	               |ГДЕ
	               |	торо_ДанныеАСУТП.Ошибка = ЛОЖЬ
	               |	И торо_ДанныеАСУТП.Обработан = ЛОЖЬ
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	МеткаВремени";
	
	резЗапроса = Запрос.Выполнить();
	Если резЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	Выборка = резЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		ОбработатьПоСеансу(Выборка.ИДСеанса);
		СформироватьПочтовыеУведомление(Выборка.ИДСеанса);
	КонецЦикла;
	#КонецУдаления
	#Вставка
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	торо_ДанныеАСУТП.ИДСеанса КАК ИДСеанса,
	               |	торо_ДанныеАСУТП.Подключение КАК Подключение
	               |ИЗ
	               |	РегистрСведений.торо_ДанныеАСУТП КАК торо_ДанныеАСУТП
	               |ГДЕ
	               |	торо_ДанныеАСУТП.Ошибка = ЛОЖЬ
	               |	И торо_ДанныеАСУТП.Обработан = ЛОЖЬ
	               |ИТОГИ ПО
	               |	Подключение";

	резЗапроса = Запрос.Выполнить();
	Если резЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	Выборка1 = резЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока Выборка1.Следующий() Цикл
		ТемпМассив = Новый Массив();
		Выборка = Выборка1.Выбрать();
		Пока Выборка.Следующий() Цикл
			ТемпМассив.Добавить(Выборка.ИДСеанса);
		КонецЦикла;
		
		ОбработатьПоСеансу(ТемпМассив);
		СформироватьПочтовыеУведомление(ТемпМассив);
	КонецЦикла;
	#КонецВставки
	
КонецПроцедуры

&ИзменениеИКонтроль("СформироватьПочтовыеУведомление")
Процедура Расш_гкс_СформироватьПочтовыеУведомление(ИДСеанса)

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	торо_СобытияИнтеграцииСАСУТП.Ошибка КАК Ошибка
	|ИЗ
	|	РегистрСведений.торо_СобытияИнтеграцииСАСУТП КАК торо_СобытияИнтеграцииСАСУТП
	|ГДЕ
	#Удаление
	|	торо_СобытияИнтеграцииСАСУТП.ИДСеанса = &ИДСеанса
	#КонецУдаления
	#Вставка
	|	торо_СобытияИнтеграцииСАСУТП.ИДСеанса В (&ИДСеанса)
	#КонецВставки
	|	И торо_СобытияИнтеграцииСАСУТП.ТипСобытия = &ТипСобытия
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	торо_СписокОповещаемыхЛиц.ОповещаемоеЛицо КАК ОповещаемоеЛицо
	|ИЗ
	|	РегистрСведений.торо_СписокОповещаемыхЛиц КАК торо_СписокОповещаемыхЛиц";

	Запрос.УстановитьПараметр("ИДСеанса", ИДСеанса);
	Запрос.УстановитьПараметр("ТипСобытия", Перечисления.торо_СобытияИнтеграции.Ошибка);

	резЗапроса = Запрос.ВыполнитьПакет();

	Если резЗапроса[0].Пустой() или резЗапроса[1].Пустой() Тогда
		Возврат;
	КонецЕсли;

	СписокОшибок = резЗапроса[0].Выбрать();
	СписокЛиц = резЗапроса[1].Выбрать();

	ТемаПисьма = "Ошибка при обмене с АСУ ТП (" + ТекущаяДата() + "). Зафиксировано " + СписокОшибок.Количество() + " ошибок.";
	ТелоПисьма = "";
	Пока СписокОшибок.Следующий() Цикл
		Если ТелоПисьма = "" Тогда
			ТелоПисьма = СписокОшибок.Ошибка + ";";
		Иначе 
			ТелоПисьма = ТелоПисьма + Символы.ПС + "===============" + Символы.ПС + СписокОшибок.Ошибка + ";";
		КонецЕсли;
	КонецЦикла;

	Пока СписокЛиц.следующий() Цикл
		мз = РегистрыСведений.торо_ОчередьУведомлений.СоздатьМенеджерЗаписи();
		мз.Пользователь = СписокЛиц.ОповещаемоеЛицо;
		мз.ID_уведомления = Новый УникальныйИдентификатор;
		мз.СпособУведомления = Перечисления.торо_СпособыУведомленияПользователей.УведомлениеПоЭлектроннойПочте;
		мз.ТемаПисьма = ТемаПисьма;
		мз.ТелоПисьма = ТелоПисьма;
		мз.Записать();
	КонецЦикла;

КонецПроцедуры

&ИзменениеИКонтроль("ОбработатьСигналСостояние")
Процедура Расш_гкс_ОбработатьСигналСостояние(Выборка, масСозданныхДокументов, сооДокументыИИсхДанные)
	#Вставка
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	торо_ТекущееСостояниеОРСрезПоследних.ВидЭксплуатации КАК ВидЭксплуатации
		|ИЗ
		|	РегистрСведений.торо_ТекущееСостояниеОР.СрезПоследних(, ОбъектРемонта = &ОР) КАК торо_ТекущееСостояниеОРСрезПоследних
		|ГДЕ
		|	НЕ торо_ТекущееСостояниеОРСрезПоследних.ВидЭксплуатации = &ВидЭксплуатации";
	
	Запрос.УстановитьПараметр("ВидЭксплуатации", Выборка.Состояние);
	Запрос.УстановитьПараметр("ОР", Выборка.ОР);
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда 
		Возврат;
	КонецЕсли;
	#КонецВставки
	докОб = Документы.торо_СостоянияОбъектовРемонта.СоздатьДокумент();
	ЗаполнитьЗначенияСвойств(докОб, Выборка);
	докОб.Дата = ТекущаяДата();
	докОб.Комментарий = НСтр("ru='Документ сформирован автоматически при загрузке данных АСУ ТП.'");
	#Вставка
	докОб.Комментарий = НСтр("es='El documento es formado automáticamente a la carga de los SISTEMAS"
		+ " informatizados de gestión ТП dados.';ru='Документ сформирован автоматически при загрузке данных"
		+ " АСУ ТП.';en='The document is generated automatically when loading the data from the automatic"
		+ " process control system.'");
	#КонецВставки
	докОб.ВидОперации = Перечисления.торо_ВидыОперацийОтклоненияВРаботеОборудования.ВидЭксплуатации;

	нс = докОб.ОбъектыРемонта.Добавить();
	нс.ДатаОкончания = Выборка.Дата;
	нс.ОбъектРемонта = Выборка.ОР;
	нс.ВидЭксплуатации = Выборка.Состояние;
	нс.ПричинаПростоя = Выборка.ПричинаПростоя;

	докОб.Записать(РежимЗаписиДокумента.Запись);
	масСозданныхДокументов.Добавить(докОб.Ссылка);
	Если сооДокументыИИсхДанные[докОб.Ссылка] = Неопределено Тогда
		сооДокументыИИсхДанные.Вставить(докОб.Ссылка, выборка);
	КонецЕсли;
КонецПроцедуры

&ИзменениеИКонтроль("ОбработатьПоСеансу")
Процедура Расш_гкс_ОбработатьПоСеансу(ИДСеанса, НомерПопытки)

	Если НомерПопытки > 100 Тогда
		Возврат;
	КонецЕсли;

	ОсновнаяИерархия = Константы.торо_ИерархияДляВводаНовыхОР.Получить();
	УдалятьОбработанныеЗаписи = Константы.торо_УдалятьОбработанныеЗаписиАСУТП.Получить();
	СоздаватьДефекты = ПолучитьФункциональнуюОпцию("торо_ИспользоватьРемонтыПоСостоянию");
	СоздаватьДокументыКПИ = ПолучитьФункциональнуюОпцию("торо_ПоказыватьПодсистемуKPI");
	#Вставка
	СоздаватьОбщие = Константы.гкс_АСУТПСоздаватьОбщийДокумент.Получить();
	ДокументОбъектУчетНаработкиОборудования = Неопределено;
	ДокументОбъектУчетКонтролируемыхПоказателей = Неопределено;
	ВыборкаКСозданиюДефектов = Новый Массив();
	#КонецВставки

	Запрос = новый Запрос;
	#Удаление
	Запрос.Текст = "ВЫБРАТЬ
	|	торо_ДанныеАСУТП.Тег КАК Тег,
	|	торо_ДанныеАСУТП.НаименованиеОР КАК НаименованиеОР,
	|	торо_ДанныеАСУТП.Дата КАК Дата,
	|	торо_ДанныеАСУТП.МеткаВремени КАК МеткаВремени,
	|	торо_ДанныеАСУТП.Значение КАК Значение,
	|	торо_ДанныеАСУТП.ИДСеанса КАК ИДСеанса,
	|	торо_ДанныеАСУТП.ИДЗаписи КАК ИДЗаписи,
	|	торо_ДанныеАСУТП.Подключение КАК Подключение
	|ПОМЕСТИТЬ табАСУТП
	|ИЗ
	|	РегистрСведений.торо_ДанныеАСУТП КАК торо_ДанныеАСУТП
	|ГДЕ
	|	торо_ДанныеАСУТП.ИДСеанса = &ИДСеанса
	|	И торо_ДанныеАСУТП.Ошибка = ЛОЖЬ
	|	И торо_ДанныеАСУТП.Обработан = ЛОЖЬ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	торо_ДанныеАСУТП.Тег КАК Тег,
	|	торо_ДанныеАСУТП.НаименованиеОР КАК НаименованиеОР,
	|	торо_ДанныеАСУТП.Дата КАК Дата,
	|	торо_ДанныеАСУТП.МеткаВремени КАК МеткаВремени,
	|	торо_ДанныеАСУТП.Значение КАК Значение,
	|	торо_ДанныеАСУТП.ИДСеанса КАК ИДСеанса,
	|	торо_ДанныеАСУТП.ИДЗаписи КАК ИДЗаписи,
	|	торо_ДанныеАСУТП.Подключение КАК Подключение,
	|	торо_СоответствияТеговАСУТПОбъектамТОИР.ОбъектРемонта КАК ОР,
	|	торо_СоответствияТеговАСУТПОбъектамТОИР.ТипСигнала КАК ТипСигнала,
	|	торо_СоответствияТеговАСУТПОбъектамТОИР.Показатель КАК Показатель,
	|	торо_СоответствияТеговАСУТПОбъектамТОИР.ПараметрНаработки КАК ПараметрНаработки,
	|	торо_СоответствияТеговАСУТПОбъектамТОИР.Состояние КАК Состояние,
	|	торо_СоответствияТеговАСУТПОбъектамТОИР.Ответственный КАК Ответственный,
	|	торо_СоответствияТеговАСУТПОбъектамТОИР.Подразделение КАК Подразделение,
	|	торо_СоответствияТеговАСУТПОбъектамТОИР.Организация КАК Организация,
	|	торо_СоответствияТеговАСУТПОбъектамТОИР.ВидДефекта КАК ТиповойДефект,
	|	торо_СоответствияТеговАСУТПОбъектамТОИР.ПричинаПростоя КАК ПричинаПростоя,
	|	торо_СоответствияТеговАСУТПОбъектамТОИР.ПоказательKPI КАК ПоказательКПИ
	|ПОМЕСТИТЬ ИсхДанные
	|ИЗ
	|	табАСУТП КАК торо_ДанныеАСУТП
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_СоответствияТеговАСУТПОбъектамТОИР КАК торо_СоответствияТеговАСУТПОбъектамТОИР
	|		ПО торо_ДанныеАСУТП.Подключение = торо_СоответствияТеговАСУТПОбъектамТОИР.Подключение
	|			И торо_ДанныеАСУТП.Тег = торо_СоответствияТеговАСУТПОбъектамТОИР.Тег
	|			И торо_ДанныеАСУТП.НаименованиеОР = торо_СоответствияТеговАСУТПОбъектамТОИР.НаименованиеОР
	|			И (торо_СоответствияТеговАСУТПОбъектамТОИР.Отключить = ЛОЖЬ)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИсхДанные.Тег КАК Тег,
	|	ИсхДанные.НаименованиеОР КАК НаименованиеОР,
	|	ИсхДанные.Дата КАК Дата,
	|	ИсхДанные.МеткаВремени КАК МеткаВремени,
	|	ИсхДанные.Значение КАК Значение,
	|	ИсхДанные.ОР КАК ОР,
	|	ИсхДанные.ТипСигнала КАК ТипСигнала,
	|	ИсхДанные.Показатель КАК Показатель,
	|	ИсхДанные.ПараметрНаработки КАК ПараметрНаработки,
	|	ИсхДанные.Состояние КАК Состояние,
	|	ИсхДанные.Ответственный КАК Ответственный,
	|	ИсхДанные.Подразделение КАК Подразделение,
	|	ИсхДанные.Организация КАК Организация,
	|	ИсхДанные.ПричинаПростоя КАК ПричинаПростоя,
	|	ИсхДанные.ПоказательКПИ КАК ПоказательКПИ,
	|	ИсхДанные.ИДСеанса КАК ИДСеанса,
	|	ИсхДанные.ИДЗаписи КАК ИДЗаписи,
	|	ИсхДанные.Подключение КАК Подключение,
	|	ВЫБОР
	|		КОГДА ИсхДанные.ОР ЕСТЬ NULL
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК Ошибка,
	|	ИСТИНА КАК Обработан,
	|	ИсхДанные.ТиповойДефект КАК ТиповойДефект,
	|	торо_ТиповыеДефектыОборудования.ВидДефекта КАК ВидДефекта,
	|	торо_ТиповыеДефектыОборудования.КритичностьДефекта КАК КритичностьДефекта,
	|	торо_ТиповыеДефектыОборудования.ОписаниеДефекта КАК ДефектОписание,
	|	торо_ТиповыеДефектыОборудования.ПоследствиеДефекта КАК ПоследствияДефекта,
	|	торо_ТиповыеДефектыОборудования.НаправлениеНаУстранение КАК НаправлениеНаУстранение,
	|	торо_ТиповыеДефектыОборудования.ПричиныВозникновенияДефекта.(
	|		НомерСтроки КАК НомерСтроки,
	|		Причина КАК Причина
	|	) КАК ПричиныВозникновенияДефекта
	|ИЗ
	|	ИсхДанные КАК ИсхДанные
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.торо_ТиповыеДефектыОборудования КАК торо_ТиповыеДефектыОборудования
	|		ПО ИсхДанные.ТиповойДефект = торо_ТиповыеДефектыОборудования.Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	торо_ДанныеАСУТП.Тег КАК Тег,
	|	торо_ДанныеАСУТП.НаименованиеОР КАК НаименованиеОР,
	|	торо_ДанныеАСУТП.Дата КАК Дата,
	|	торо_ДанныеАСУТП.МеткаВремени КАК МеткаВремени,
	|	торо_ДанныеАСУТП.Значение КАК Значение,
	|	торо_ДанныеАСУТП.ИДСеанса КАК ИДСеанса,
	|	торо_ДанныеАСУТП.ИДЗаписи КАК ИДЗаписи,
	|	торо_ДанныеАСУТП.Подключение КАК Подключение
	|ИЗ
	|	РегистрСведений.торо_ДанныеАСУТП КАК торо_ДанныеАСУТП
	|ГДЕ
	|	торо_ДанныеАСУТП.ИДСеанса = &ИДСеанса
	|	И торо_ДанныеАСУТП.Ошибка = ИСТИНА";
	#КонецУдаления
	#Вставка
	Запрос.Текст = ПолучитьНовыйТекстЗапроса();
	#КонецВставки

	Запрос.УстановитьПараметр("ИДСеанса", ИДСеанса);

	резЗапроса = Запрос.ВыполнитьПакет();
	ИсхДанные = резЗапроса[2];
	списокОшибок = резЗапроса[3].Выгрузить();

	масОшибок = Новый Массив;
	масСозданныхДокументов = Новый Массив;
	сооДокументыИИсхДанные = Новый Соответствие;
	сооОбработчики = торо_ОбработкаДанныхАСУТППереопределяемый.ПолучитьСписокПереопределяемыхФункцийОбработчиков();

	НачатьТранзакцию();
	ОшибкаТранзакции = Ложь;
	Попытка
		Если НЕ ИсхДанные.Пустой() Тогда
			#Вставка
			ПредыдущееЗначениеПодключения = Неопределено;
			ПредыдущееЗначениеТега = Неопределено;
			ПредыдущееЗначениеНаименованияОбъектаРемонта = Неопределено;
			ПредыдущееЗначениеЗначенияСтрокиЗапроса = Неопределено;
			#КонецВставки
			ВыборкаТЗ = ИсхДанные.Выгрузить();
			Для каждого Выборка из ВыборкаТЗ Цикл

				Если Выборка.ТипСигнала = Перечисления.торо_ТипыСигналовАСУТП.Наработка Тогда
					Если сооОбработчики[Перечисления.торо_ТипыСигналовАСУТП.Наработка] = Ложь Тогда
						#Вставка
						Если СоздаватьОбщие Тогда 
							ОбработатьСигналНаработкаОбщий(Выборка, ОсновнаяИерархия, ДокументОбъектУчетНаработкиОборудования);
						Иначе
							ОбработатьСигналНаработка(Выборка, масСозданныхДокументов, сооДокументыИИсхДанные, ОсновнаяИерархия);
						КонецЕсли;
						#КонецВставки
						#Удаление
						ОбработатьСигналНаработка(Выборка, масСозданныхДокументов, сооДокументыИИсхДанные, ОсновнаяИерархия);
						#КонецУдаления
					Иначе
						торо_ОбработкаДанныхАСУТППереопределяемый.Наработка(Выборка, масСозданныхДокументов, сооДокументыИИсхДанные, ОсновнаяИерархия);
					КонецЕсли;
				ИначеЕсли Выборка.ТипСигнала = Перечисления.торо_ТипыСигналовАСУТП.Показатель Тогда
					Если сооОбработчики[Перечисления.торо_ТипыСигналовАСУТП.Показатель] = Ложь Тогда
						#Вставка
						Если СоздаватьОбщие Тогда 
							ОбработатьСигналПоказательОбщий(Выборка, СоздаватьДефекты, ДокументОбъектУчетКонтролируемыхПоказателей,
								ВыборкаКСозданиюДефектов);
						Иначе
							ОбработатьСигналПоказатель(Выборка, масСозданныхДокументов, сооДокументыИИсхДанные, СоздаватьДефекты);
						КонецЕсли;
						#КонецВставки
						#Удаление
						ОбработатьСигналПоказатель(Выборка, масСозданныхДокументов, сооДокументыИИсхДанные, СоздаватьДефекты);
						#КонецУдаления
					Иначе
						торо_ОбработкаДанныхАСУТППереопределяемый.Показатель(Выборка, масСозданныхДокументов, сооДокументыИИсхДанные, ОсновнаяИерархия);
					КонецЕсли;
				ИначеЕсли Выборка.ТипСигнала = Перечисления.торо_ТипыСигналовАСУТП.Состояние Тогда
					#Вставка
					Если Выборка.Подключение = ПредыдущееЗначениеПодключения 
						И Выборка.Тег = ПредыдущееЗначениеТега 
						И Выборка.НаименованиеОР = ПредыдущееЗначениеНаименованияОбъектаРемонта 
						И Выборка.Значение = ПредыдущееЗначениеЗначенияСтрокиЗапроса Тогда 
						Продолжить;
					Иначе
						ПредыдущееЗначениеПодключения = Выборка.Подключение;
						ПредыдущееЗначениеТега = Выборка.Тег;
						ПредыдущееЗначениеНаименованияОбъектаРемонта = Выборка.НаименованиеОР;
						ПредыдущееЗначениеЗначенияСтрокиЗапроса = Выборка.Значение;
					КонецЕсли;
					#КонецВставки
					Если сооОбработчики[Перечисления.торо_ТипыСигналовАСУТП.Состояние] = Ложь Тогда
						ОбработатьСигналСостояние(Выборка, масСозданныхДокументов, сооДокументыИИсхДанные);
					Иначе
						торо_ОбработкаДанныхАСУТППереопределяемый.СостояниеОР(Выборка, масСозданныхДокументов, сооДокументыИИсхДанные, ОсновнаяИерархия);
					КонецЕсли;
				ИначеЕсли Выборка.ТипСигнала = Перечисления.торо_ТипыСигналовАСУТП.Дефект Тогда
					Если СоздаватьДефекты Тогда
						Если сооОбработчики[Перечисления.торо_ТипыСигналовАСУТП.Дефект] = Ложь Тогда
							ОбработатьСигналДефект(Выборка, масСозданныхДокументов, сооДокументыИИсхДанные);
						Иначе
							торо_ОбработкаДанныхАСУТППереопределяемый.Дефект(Выборка, масСозданныхДокументов, сооДокументыИИсхДанные, ОсновнаяИерархия);
						КонецЕсли;
					КонецЕсли;
				ИначеЕсли Выборка.ТипСигнала = Перечисления.торо_ТипыСигналовАСУТП.KPI Тогда
					Если СоздаватьДокументыКПИ Тогда
						Если сооОбработчики[Перечисления.торо_ТипыСигналовАСУТП.KPI] = Ложь Тогда
							ОбработатьСигналKPI(Выборка, масСозданныхДокументов, сооДокументыИИсхДанные);
						Иначе
							торо_ОбработкаДанныхАСУТППереопределяемый.KPI(Выборка, масСозданныхДокументов, сооДокументыИИсхДанные, ОсновнаяИерархия);
						КонецЕсли;
					КонецЕсли;
				Иначе 
					#Удаление
					ВызватьИсключение НСтр("ru='Не распознан тип сигнала.'");
					#КонецУдаления
					#Вставка
					ВызватьИсключение НСтр("es='de la señal.';ru='Не распознан тип сигнала.';en='Signal type not recognized.'");
					#КонецВставки
				КонецЕсли;
			КонецЦикла;
			#Вставка
			Если Не ДокументОбъектУчетНаработкиОборудования = Неопределено Тогда 
				ДокументОбъектУчетНаработкиОборудования.Записать(РежимЗаписиДокумента.Запись);
				ДокументОбъектУчетНаработкиОборудования.Записать(РежимЗаписиДокумента.Проведение);
			КонецЕсли;
			Если Не ДокументОбъектУчетКонтролируемыхПоказателей = Неопределено Тогда 
				ДокументОбъектУчетКонтролируемыхПоказателей.Записать(РежимЗаписиДокумента.Запись);
				масСозданныхДокументов.Добавить(ДокументОбъектУчетКонтролируемыхПоказателей.Ссылка);
				сооДокументыИИсхДанные.Вставить(ДокументОбъектУчетКонтролируемыхПоказателей.Ссылка, Выборка);
				Если СоздаватьДефекты Тогда
					ДокументыВДКСозданию = новый СписокЗначений;
					торо_РемонтыПоСостоянию.СформироватьУведомленияИДефекты(ДокументОбъектУчетКонтролируемыхПоказателей,
						ДокументыВДКСозданию);
				КонецЕсли;
				
			КонецЕсли;
			#КонецВставки
		КонецЕсли;
	Исключение
		ОшибкаТранзакции = Истина;
		ОтменитьТранзакцию();
		ЗарегистрироватьОшибкуИнтеграции(Выборка, 
		Перечисления.торо_ОшибкиАСУТП.ГенерацияИЗаписьНовыхДокументов,
		ОписаниеОшибки());
	КонецПопытки;	

	Если ОшибкаТранзакции Тогда
		мз = РегистрыСведений.торо_ДанныеАСУТП.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(мз, Выборка);
		мз.Ошибка = Истина;
		мз.Записать();

		ОбработатьПоСеансу(ИДСеанса, НомерПопытки+1);
	Иначе
		#Вставка
		Для Каждого СтрокаМассиваИДСеансов Из ИДСеанса Цикл
			НаборЗаписейРегистраторо_ДанныеАСУТП = РегистрыСведений.торо_ДанныеАСУТП.СоздатьНаборЗаписей();
			НаборЗаписейРегистраторо_ДанныеАСУТП.Отбор.ИДСеанса.установить(СтрокаМассиваИДСеансов);
			
			Если УдалятьОбработанныеЗаписи = Истина Тогда 
				НаборЗаписейРегистраторо_ДанныеАСУТП.Загрузить(списокОшибок);
			Иначе
				НаборЗаписейРегистраторо_ДанныеАСУТП.Прочитать();
				Для каждого ЗаписьНабораЗаписейРегистраторо_ДанныеАСУТП из НаборЗаписейРегистраторо_ДанныеАСУТП цикл
					ЗаписьНабораЗаписейРегистраторо_ДанныеАСУТП.Обработан = Истина;
				КонецЦикла;
			КонецЕсли;
			НаборЗаписейРегистраторо_ДанныеАСУТП.Записать();
		КонецЦикла;
		#КонецВставки
		#Удаление
		нз = РегистрыСведений.торо_ДанныеАСУТП.СоздатьНаборЗаписей();
		нз.Отбор.ИДСеанса.установить(ИДСеанса);

		Если УдалятьОбработанныеЗаписи = Истина Тогда 
			нз.Загрузить(списокОшибок);
		Иначе
			нз.Прочитать();
			Для каждого текЗапись из нз цикл
				текЗапись.Обработан = Истина;
			КонецЦикла;
		КонецЕсли;
		нз.Записать();
		#КонецУдаления

		ЗафиксироватьТранзакцию();

		Для каждого текДок из масСозданныхДокументов цикл
			попытка
				докОб = текДок.ПолучитьОбъект();
				докОб.Записать(РежимЗаписиДокумента.Проведение);
			Исключение
				ОписаниеОшибки = ОписаниеОшибки();
				ЗаписьЖурналаРегистрации(НСтр("ru = 'Исключение'"), УровеньЖурналаРегистрации.Предупреждение,,,ОписаниеОшибки);
				ЗарегистрироватьОшибкуИнтеграции(сооДокументыИИсхДанные[текДок], Перечисления.торо_ОшибкиАСУТП.ПроведениеНовыхДокументов, ОписаниеОшибки, текДок);
			КонецПопытки;
		КонецЦикла;

	КонецЕсли;

КонецПроцедуры

&ИзменениеИКонтроль("ОбработатьСигналНаработка")
Процедура Расш_гкс_ОбработатьСигналНаработка(Выборка, масСозданныхДокументов, сооДокументыИИсхДанные, ОсновнаяИерархия)

	ДокОб = Документы.торо_УчетНаработкиОборудования.СоздатьДокумент();
	ЗаполнитьЗначенияСвойств(докОб, Выборка);
	докОб.Дата = ТекущаяДата();
	#Удаление
	докОб.Комментарий = НСтр("ru='Документ сформирован автоматически при загрузке данных АСУ ТП.'");
	#КонецУдаления
	#Вставка
	докОб.Комментарий = НСтр("es='El documento es formado automáticamente a la carga de los SISTEMAS"
	+ " informatizados de gestión ТП dados.';ru='Документ сформирован автоматически при загрузке данных"
	+ " АСУ ТП.';en='The document is generated automatically when loading the data from the automatic"
	+ " process control system.'");
	#КонецВставки

	нс = докОб.НаработкаОбъектов.Добавить();
	нс.Объект = выборка.ОР;
	нс.Показатель = Выборка.ПараметрНаработки;
	нс.Наработка = Выборка.Значение;
	нс.ДатаРаботыПо = Выборка.Дата;

	ЗначениеНаработки = торо_РаботаСНаработкой.ПолучитьТекущееЗначениеНаработки(нс.Объект, нс.Показатель, Неопределено);
	Если ЗначениеЗаполнено(ЗначениеНаработки) Тогда
		нс.ДатаРаботыС = ЗначениеНаработки.НаработаноДата;
		нс.СтароеЗначение = ЗначениеНаработки.НаработаноЗначение;
	КонецЕсли;
	нс.НовоеЗначение = нс.СтароеЗначение + нс.Наработка;
	нс.Иерархия = ОсновнаяИерархия;

	докОб.Записать(РежимЗаписиДокумента.Запись);
	докОб.Записать(РежимЗаписиДокумента.Проведение);

КонецПроцедуры

&ИзменениеИКонтроль("ОбработатьСигналПоказатель")
Процедура Расш_гкс_ОбработатьСигналПоказатель(Выборка, масСозданныхДокументов, сооДокументыИИсхДанные, СоздаватьДефекты)
	ДокОб = Документы.торо_УчетКонтролируемыхПоказателей.СоздатьДокумент();
	ЗаполнитьЗначенияСвойств(докОб, Выборка);
	докОб.Дата = Выборка.МеткаВремени;
	#Удаление
	докОб.Комментарий = НСтр("ru='Документ сформирован автоматически при загрузке данных АСУ ТП.'");
	#КонецУдаления
	#Вставка
	докОб.Комментарий = НСтр("es='El documento es formado automáticamente a la carga de los SISTEMAS "
	+ "informatizados de gestión ТП dados.';ru='Документ сформирован автоматически при загрузке данных"
	+ " АСУ ТП.';en='The document is generated automatically when loading the data from the "
	+ "automatic process control system.'");
	#КонецВставки

	нс = ДокОб.Показатели.Добавить();
	ЗаполнитьЗначенияСвойств(нс, Выборка);
	нс.ОбъектРемонта = Выборка.ОР;
	нс.ДатаКонтроля = Выборка.Дата;

	докОб.Записать(РежимЗаписиДокумента.Запись);
	масСозданныхДокументов.Добавить(докОб.Ссылка);
	Если сооДокументыИИсхДанные[докОб.Ссылка] = Неопределено Тогда
		сооДокументыИИсхДанные.Вставить(докОб.Ссылка, выборка);
	КонецЕсли;

	Если СоздаватьДефекты Тогда
		ДокументыВДКСозданию = новый СписокЗначений;
		торо_РемонтыПоСостоянию.СформироватьУведомленияИДефекты(ДокОб, ДокументыВДКСозданию);

		Для каждого текДок из ДокументыВДКСозданию Цикл

			ОбработатьСигналДефект(Выборка, масСозданныхДокументов, сооДокументыИИсхДанные);

		КонецЦикла;
	КонецЕсли;

КонецПроцедуры

&ИзменениеИКонтроль("ОбработатьСигналДефект")
Процедура Расш_гкс_ОбработатьСигналДефект(Выборка, масСозданныхДокументов, сооДокументыИИсхДанные)
	докОб = Документы.торо_ВыявленныеДефекты.СоздатьДокумент();
	ЗаполнитьЗначенияСвойств(докОб, Выборка);
	докОб.Дата = ТекущаяДата();
	докОб.ДатаОбнаружения = Выборка.дата;
	докОб.ДефектВыявленВПроцессе = Справочники.торо_УсловияВыявленияДефекта.ПоДаннымАСУТП;

	#Удаление
	докОб.Комментарий = НСтр("ru='Документ сформирован автоматически при загрузке данных АСУ ТП.'");
	#КонецУдаления
	#Вставка
	докОб.Комментарий = НСтр("es='El documento es formado automáticamente a la carga de los SISTEMAS"
	+ " informatizados de gestión ТП dados.';ru='Документ сформирован автоматически при загрузке данных"
	+ " АСУ ТП.';en='The document is generated automatically when loading the data from the automatic"
	+ " process control system.'");
	#КонецВставки

	нс = докОб.СписокДефектов.Добавить();
	ЗаполнитьЗначенияСвойств(нс, Выборка);
	нс.ОбъектРемонта = Выборка.ОР;
	нс.ОтказавшийЭлемент = Выборка.ОР;
	Если Выборка.ПричиныВозникновенияДефекта <> Неопределено И Выборка.ПричиныВозникновенияДефекта.Количество() > 0 Тогда
		нс.ДефектПричина = Выборка.ПричиныВозникновенияДефекта[0].Причина;
	КонецЕсли;

	докОб.Записать(РежимЗаписиДокумента.Запись);
	масСозданныхДокументов.Добавить(докОб.Ссылка);
	Если сооДокументыИИсхДанные[докОб.Ссылка] = Неопределено Тогда
		сооДокументыИИсхДанные.Вставить(докОб.Ссылка, выборка);
	КонецЕсли;
КонецПроцедуры

&ИзменениеИКонтроль("ОбработатьСигналKPI")
Процедура Расш_гкс_ОбработатьСигналKPI(Выборка, масСозданныхДокументов, сооДокументыИИсхДанные)
	докОб = Документы.торо_РегистрацияЗначенийВнешнихПоказателейKPI.СоздатьДокумент();
	ЗаполнитьЗначенияСвойств(докОб, Выборка);
	докОб.Дата = ТекущаяДата();
	#Удаление
	докОб.Комментарий = НСтр("ru='Документ сформирован автоматически при загрузке данных АСУ ТП.'");
	#КонецУдаления
	#Вставка
	докОб.Комментарий = НСтр("es='El documento es formado automáticamente a la carga de los SISTEMAS"
	+" informatizados de gestión ТП dados.';ru='Документ сформирован автоматически при загрузке данных"
	+" АСУ ТП.';en='The document is generated automatically when loading the data from the automatic"
	+" process control system.'");
	#КонецВставки

	нс = докОб.ЗначенияПоказателей.Добавить();
	нс.Показатель = Выборка.ПоказательКПИ;
	нс.Период = Выборка.Дата;
	нс.Значение = Выборка.Значение;
	нс.Подразделение = Выборка.Подразделение;
	нс.ОбъектРемонта = Выборка.ОР;

	докОб.Записать(РежимЗаписиДокумента.Запись);
	масСозданныхДокументов.Добавить(докОб.Ссылка);
	Если сооДокументыИИсхДанные[докОб.Ссылка] = Неопределено Тогда
		сооДокументыИИсхДанные.Вставить(докОб.Ссылка, выборка);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти
